# **PROGRAM - 4**
### **AIM:** Programs to handle data using pandas.
### **DATASET:**Salaries.csv

### **SERIES**

In [ ]:
  import numpy as np
  import pandas as pd

To convert list,numpy, array, or dictionary to a series

In [ ]:
labels =['a','b','c']
my_list = [10,20,30]
arr=np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [ ]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [ ]:
pd.Series(my_list,index=labels)

a    10
b    20
c    30
dtype: int64

NumPy Arrays:

In [ ]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [ ]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

Dictionary:

In [ ]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(d,labels)

a    10
b    20
c    30
dtype: int64

Using an Index

In [ ]:
series1 = pd.Series ([1,2,3,4,5] , index=['USA','SPAIN','GERMANY','JAPAN','UK'])

In [ ]:
series1

USA        1
SPAIN      2
GERMANY    3
JAPAN      4
UK         5
dtype: int64

In [ ]:
series2 = pd.Series ([1,2,3,4,5] , index=['USA','SPAIN','GERMANY','ITALY','UK'])
series2

USA        1
SPAIN      2
GERMANY    3
ITALY      4
UK         5
dtype: int64

In [ ]:
series1 + series2

GERMANY     6.0
ITALY       NaN
JAPAN       NaN
SPAIN       4.0
UK         10.0
USA         2.0
dtype: float64

In [ ]:
pd.Series('USA')

0    USA
dtype: object

DATAFRAMES

In [ ]:
from numpy.random import randn
np.random.seed(101)

In [ ]:
df= pd.DataFrame(randn(5,4), index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
np.random.seed(95)
df= pd.DataFrame(randn(5,4), index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A -0.664289 -0.582431  0.339579  0.599289
B  1.088540  0.097178 -0.142333  1.781748
C  0.588120  0.010733  3.455616 -1.154729
D  0.191124 -0.063445 -0.592004 -1.492861
E -0.393965  1.133565  0.185667 -1.558033

SELECTION AND INDEXING

In [ ]:
df['Z']

A    0.599289
B    1.781748
C   -1.154729
D   -1.492861
E   -1.558033
Name: Z, dtype: float64

In [ ]:
df[['Z','W']]

          Z         W
A  0.599289 -0.664289
B  1.781748  1.088540
C -1.154729  0.588120
D -1.492861  0.191124
E -1.558033 -0.393965

CREATING A NEW COLUMN BY ADDING W AND Y

In [ ]:
df['new'] = df['W']+df['Y']

In [ ]:
df

          W         X         Y         Z       new
A -0.664289 -0.582431  0.339579  0.599289 -0.324709
B  1.088540  0.097178 -0.142333  1.781748  0.946207
C  0.588120  0.010733  3.455616 -1.154729  4.043737
D  0.191124 -0.063445 -0.592004 -1.492861 -0.400881
E -0.393965  1.133565  0.185667 -1.558033 -0.208298

REMOVING new COLUMN:

In [ ]:
df.drop('new')

In [ ]:
df.drop('new', axis=1)

          W         X         Y         Z
A -0.664289 -0.582431  0.339579  0.599289
B  1.088540  0.097178 -0.142333  1.781748
C  0.588120  0.010733  3.455616 -1.154729
D  0.191124 -0.063445 -0.592004 -1.492861
E -0.393965  1.133565  0.185667 -1.558033

In [ ]:
df

          W         X         Y         Z       new
A -0.664289 -0.582431  0.339579  0.599289 -0.324709
B  1.088540  0.097178 -0.142333  1.781748  0.946207
C  0.588120  0.010733  3.455616 -1.154729  4.043737
D  0.191124 -0.063445 -0.592004 -1.492861 -0.400881
E -0.393965  1.133565  0.185667 -1.558033 -0.208298

In [ ]:
df.drop('new', axis=1, inplace=True)
df

          W         X         Y         Z
A -0.664289 -0.582431  0.339579  0.599289
B  1.088540  0.097178 -0.142333  1.781748
C  0.588120  0.010733  3.455616 -1.154729
D  0.191124 -0.063445 -0.592004 -1.492861
E -0.393965  1.133565  0.185667 -1.558033

DROP ROWS:

In [ ]:
df.loc['A']

W   -0.664289
X   -0.582431
Y    0.339579
Z    0.599289
Name: A, dtype: float64

In [ ]:
df.loc[0]

In [ ]:
df. iloc[0]

W   -0.664289
X   -0.582431
Y    0.339579
Z    0.599289
Name: A, dtype: float64

In [ ]:
df.loc['A','Y']

0.3395794850282506

In [ ]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.664289  0.339579
B  1.088540 -0.142333

CONDITIONAL SELECTION:

In [ ]:
df

          W         X         Y         Z
A -0.664289 -0.582431  0.339579  0.599289
B  1.088540  0.097178 -0.142333  1.781748
C  0.588120  0.010733  3.455616 -1.154729
D  0.191124 -0.063445 -0.592004 -1.492861
E -0.393965  1.133565  0.185667 -1.558033

In [ ]:
df>0

       W      X      Y      Z
A  False  False   True   True
B   True   True  False   True
C   True   True   True  False
D   True  False  False  False
E  False   True   True  False

In [ ]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN  0.339579  0.599289
B  1.088540  0.097178       NaN  1.781748
C  0.588120  0.010733  3.455616       NaN
D  0.191124       NaN       NaN       NaN
E       NaN  1.133565  0.185667       NaN

In [ ]:
df<0

       W      X      Y      Z
A   True   True  False  False
B  False  False   True  False
C  False  False  False   True
D  False   True   True   True
E   True  False  False   True

In [ ]:
df[df<0]

          W         X         Y         Z
A -0.664289 -0.582431       NaN       NaN
B       NaN       NaN -0.142333       NaN
C       NaN       NaN       NaN -1.154729
D       NaN -0.063445 -0.592004 -1.492861
E -0.393965       NaN       NaN -1.558033

In [ ]:
df[df['W']<0]

          W         X         Y         Z
A -0.664289 -0.582431  0.339579  0.599289
E -0.393965  1.133565  0.185667 -1.558033

In [ ]:
df['W']<0

A     True
B    False
C    False
D    False
E     True
Name: W, dtype: bool

In [ ]:
df[df['W']<0]['Y']

A    0.339579
E    0.185667
Name: Y, dtype: float64

In [ ]:
df[(df['W']<0) & (df['Y']>0)]

          W         X         Y         Z
A -0.664289 -0.582431  0.339579  0.599289
E -0.393965  1.133565  0.185667 -1.558033

In [ ]:
df[(df['W']<0) | (df['Y']>0)]

          W         X         Y         Z
A -0.664289 -0.582431  0.339579  0.599289
C  0.588120  0.010733  3.455616 -1.154729
E -0.393965  1.133565  0.185667 -1.558033

**MISSING DATA**

In [ ]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'A': [1,2,np.NaN],'B':[5,np.NaN,np.NaN],'C': [1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [ ]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [ ]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [ ]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [ ]:
df['A'].fillna(value = df['A'].mean())

NameError: ignored

**OPERATIONS IN PANDAS**

In [ ]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['ab','cd','ef','gh']})
df

   col1  col2 col3
0     1   444   ab
1     2   555   cd
2     3   666   ef
3     4   444   gh

**INFO ON UNIQUE VALUES**

In [ ]:
df['col2'].unique()

array([444, 555, 666])

In [ ]:
df['col2'].nunique()

3

In [ ]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

**SELECTING DATA:**

In [ ]:
#Select from dataframe using criteria from multiple columns
newdf = df[(df['col2']>3)& (df["col2"]==555)]
newdf

   col1  col2 col3
1     2   555   cd

**APPLYING FUNCTIONS:**

In [ ]:
def times2(x):
    return x*2

In [ ]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [ ]:
df['col3'].apply(len)

0    2
1    2
2    2
3    2
Name: col3, dtype: int64

In [ ]:
df['col1'].sum()

10

In [ ]:
del df['col2']
df

  col3
0   ab
1   cd
2   ef
3   gh

**GET COLUMN AND INDEX NAMES:**

In [ ]:
df.columns

Index(['col3'], dtype='object')

In [ ]:
df.index

RangeIndex(start=0, stop=4, step=1)

**SORTING AND ORDERING A DATAFRAME**

In [ ]:
df

  col3
0   ab
1   cd
2   ef
3   gh

In [ ]:
df.sort_values(by='col3') #inplace =False by Default

  col3
0   ab
1   cd
2   ef
3   gh

In [ ]:
df.sort_values(by='col3', inplace =True)
df

  col3
0   ab
1   cd
2   ef
3   gh

In [ ]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444]})
df

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

In [ ]:
df.sort_values(by='col1')

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

In [ ]:
df.sort_values(by='col2', inplace =True)
df

   col1  col2
0     1   444
3     4   444
1     2   555
2     3   666

**FIND NULL CVALUES OR CHECK FOR NULL VALUES**

In [ ]:
df.isnull()

    col1   col2
0  False  False
3  False  False
1  False  False
2  False  False